{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "51"}]}}}, "outputs": {"dense_5": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "17"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_13/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_13/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_13/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_14/GatherV2/indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_14/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_14/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_11/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_11/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_11/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_12/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_12/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_12/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_2/norm/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_17/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_15/GatherV2/indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_15/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_15/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_16/GatherV2/indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_16/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_16/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.expand_dims_3/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_9/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_9/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_9/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_10/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_10/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_10/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.expand_dims_2/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/reshape_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/reshape_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/reshape_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/reshape_1/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/reshape_1/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_2/FloorDiv/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_3/FloorDiv/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_17/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_17/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.reduce_max_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/flatten_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "34"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "17"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "51"}]}}}}, {"name": "StatefulPartitionedCall/model_1/reshape_1/Shape", "op": "Shape", "input": ["input_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/reshape_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/reshape_1/Shape", "StatefulPartitionedCall/model_1/reshape_1/strided_slice/stack", "StatefulPartitionedCall/model_1/reshape_1/strided_slice/stack_1", "StatefulPartitionedCall/model_1/reshape_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1/reshape_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model_1/reshape_1/strided_slice", "StatefulPartitionedCall/model_1/reshape_1/Reshape/shape/1", "StatefulPartitionedCall/model_1/reshape_1/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/reshape_1/Reshape", "op": "Reshape", "input": ["input_2", "StatefulPartitionedCall/model_1/reshape_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/reshape_1/Reshape", "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice/stack", "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice/stack_1", "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "7"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_9/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_9/GatherV2/indices", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_9/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_10/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_10/GatherV2/indices", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_10/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.size_2/Size", "op": "Size", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_9/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.gather_9/GatherV2", "StatefulPartitionedCall/model_1/tf.math.multiply_9/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_10/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.gather_10/GatherV2", "StatefulPartitionedCall/model_1/tf.math.multiply_10/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_2/FloorDiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.size_2/Size", "StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_2/FloorDiv/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_4/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/tf.math.multiply_9/Mul", "StatefulPartitionedCall/model_1/tf.math.multiply_10/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_2/FloorDiv", "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo/shape/1", "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo/shape/2"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/model_1/tf.expand_dims_2/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_4/AddV2", "StatefulPartitionedCall/model_1/tf.expand_dims_2/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/model_1/tf.expand_dims_2/ExpandDims", "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo/shape"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub", "op": "Sub", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice", "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_13/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_13/GatherV2/indices", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_13/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_14/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_14/GatherV2/indices", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_14/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_11/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_11/GatherV2/indices", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_11/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_12/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_12/GatherV2/indices", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_12/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_15/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_15/GatherV2/indices", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_15/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_16/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_16/GatherV2/indices", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_16/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.size_3/Size", "op": "Size", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_13/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.gather_13/GatherV2", "StatefulPartitionedCall/model_1/tf.math.multiply_13/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_14/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.gather_14/GatherV2", "StatefulPartitionedCall/model_1/tf.math.multiply_14/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_11/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.gather_11/GatherV2", "StatefulPartitionedCall/model_1/tf.math.multiply_11/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_12/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.gather_12/GatherV2", "StatefulPartitionedCall/model_1/tf.math.multiply_12/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_15/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.gather_15/GatherV2", "StatefulPartitionedCall/model_1/tf.math.multiply_15/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_16/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.gather_16/GatherV2", "StatefulPartitionedCall/model_1/tf.math.multiply_16/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_3/FloorDiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.size_3/Size", "StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_3/FloorDiv/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_6/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/tf.math.multiply_13/Mul", "StatefulPartitionedCall/model_1/tf.math.multiply_14/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_5/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/tf.math.multiply_11/Mul", "StatefulPartitionedCall/model_1/tf.math.multiply_12/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_7/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/tf.math.multiply_15/Mul", "StatefulPartitionedCall/model_1/tf.math.multiply_16/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_3/FloorDiv", "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo/shape/1", "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo/shape/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.subtract_4/Sub", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_6/AddV2", "StatefulPartitionedCall/model_1/tf.__operators__.add_5/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.expand_dims_3/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_7/AddV2", "StatefulPartitionedCall/model_1/tf.expand_dims_3/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_2/norm/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_4/Sub", "StatefulPartitionedCall/model_1/tf.compat.v1.norm_2/norm/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/model_1/tf.expand_dims_3/ExpandDims", "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_2/norm/Sqrt", "op": "Sqrt", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.norm_2/norm/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.subtract_5/Sub", "op": "Sub", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub", "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_2/norm/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.norm_2/norm/Sqrt"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_17/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_5/Sub", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_17/GatherV2/indices", "StatefulPartitionedCall/model_1/tf.compat.v1.gather_17/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_17/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.norm_2/norm/Squeeze", "StatefulPartitionedCall/model_1/tf.math.multiply_17/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.gather_17/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/Sqrt", "op": "Sqrt", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/Sqrt"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.reduce_max_1/Max", "op": "Max", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/Squeeze", "StatefulPartitionedCall/model_1/tf.math.reduce_max_1/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.maximum_1/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/model_1/tf.math.multiply_17/Mul", "StatefulPartitionedCall/model_1/tf.math.reduce_max_1/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.math.truediv_1/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/model_1/tf.math.subtract_3/Sub", "StatefulPartitionedCall/model_1/tf.math.maximum_1/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/tf.math.truediv_1/truediv", "StatefulPartitionedCall/model_1/flatten_1/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_3/Relu6", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_1/flatten_1/Reshape", "StatefulPartitionedCall/model_1/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_1/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_1/dense_4/Relu6", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_1/dense_3/Relu6", "StatefulPartitionedCall/model_1/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_1/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model_1/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_1/dense_4/Relu6", "StatefulPartitionedCall/model_1/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_1/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_1/dense_5/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model_1/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_1/dense_5/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_13/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_13/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_13/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_14/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_14/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_14/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_11/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_11/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_11/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_12/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_12/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_12/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_2/norm/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_17/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_15/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_15/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_15/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_16/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_16/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_16/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/tf.expand_dims_3/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_9/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_9/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_9/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_10/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_10/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.multiply_10/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/tf.expand_dims_2/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/reshape_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/reshape_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/reshape_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/reshape_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/reshape_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.getitem_1/strided_slice/stack_2", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_2/FloorDiv/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_2/BroadcastTo/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.floor_div_3/FloorDiv/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.broadcast_to_3/BroadcastTo/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_17/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.gather_17/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.norm_3/norm/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.math.reduce_max_1/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/dense_3/MatMul/ReadVariableOp", "shape": [34, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/dense_3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/dense_4/MatMul/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/dense_4/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/dense_5/MatMul/ReadVariableOp", "shape": [64, 17], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/dense_5/BiasAdd/ReadVariableOp", "shape": [17], "dtype": "float32"}]}]}